1.5speed_original/lesChannelCase_1.5_speed/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;    location "0";
    object p;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0.0;

boundaryField
{
    inlet
    {
    
        type zeroGradient;
    }
    outlet
    {
    
        type fixedValue;
    
        value uniform 0.0;
    }
    upperWall
    {
    
        type zeroGradient;
    }
    lowerWall
    {
    
        type zeroGradient;
    }
    frontAndBack
    {
    
        type empty;
    }
}
