1.5speed_original/lesChannelCase_1.5_speed/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object transportProperties;
}

transportModel Newtonian;

nu nu [0 2 -1 0 0 0 0] 1e-05;
