1.5speed_original/lesChannelCase_1.5_speed/constant/turbulenceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object turbulenceProperties;
}

simulationType LES;

LES
{
    LESModel Smagorinsky;
    turbulence yes;
    printCoeffs yes;
    delta cubeRootVol;
}
