1.5speed_original/lesChannelCase_1.5_speed/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object blockMeshDict;
}

scale 0.001;

vertices ((-20.6 0.0 -0.5) (-20.6 25.4 -0.5) (0.0 -25.4 -0.5) (0.0 0.0 -0.5) (0.0 25.4 -0.5) (206.0 -25.4 -0.5) (206.0 0.0 -0.5) (206.0 25.4 -0.5) (290.0 -16.6 -0.5) (290.0 0.0 -0.5) (290.0 16.6 -0.5) (-20.6 0.0 0.5) (-20.6 25.4 0.5) (0.0 -25.4 0.5) (0.0 0.0 0.5) (0.0 25.4 0.5) (206.0 -25.4 0.5) (206.0 0.0 0.5) (206.0 25.4 0.5) (290.0 -16.6 0.5) (290.0 0.0 0.5) (290.0 16.6 0.5));

blocks (hex (0 3 4 1 11 14 15 12) (18 30 1) simpleGrading (0.5 1.0 1.0) hex (2 5 6 3 13 16 17 14) (180 27 1) simpleGrading (1.0 1.0 1.0) hex (3 6 7 4 14 17 18 15) (180 30 1) simpleGrading (1.0 1.0 1.0) hex (5 8 9 6 16 19 20 17) (25 27 1) simpleGrading (2.5 1.0 1.0) hex (6 9 10 7 17 20 21 18) (25 30 1) simpleGrading (2.5 1.0 1.0));

edges ();

boundary (inlet {type patch; faces ((0 1 12 11));} outlet {type patch; faces ((8 9 20 19) (9 10 21 20));} upperWall {type wall; faces ((1 4 15 12) (4 7 18 15) (7 10 21 18));} lowerWall {type wall; faces ((0 3 14 11) (3 2 13 14) (2 5 16 13) (5 8 19 16));} frontAndBack {type empty; faces ((0 3 4 1) (2 5 6 3) (3 6 7 4) (5 8 9 6) (6 9 10 7) (11 14 15 12) (13 16 17 14) (14 17 18 15) (16 19 20 17) (17 20 21 18));});

mergePatchPairs ();
