1.5speed_original/lesChannelCase_1.5_speed/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object fvSolution;
}

solvers
{
    p
    {
    
        solver GAMG;
    
        tolerance 1e-07;
    
        relTol 0.01;
    
        smoother DICGaussSeidel;
    }
    pFinal
    {
    
        solver GAMG;
    
        tolerance 1e-07;
    
        relTol 0.0;
    
        smoother DICGaussSeidel;
    }
    U
    {
    
        solver smoothSolver;
    
        smoother symGaussSeidel;
    
        tolerance 1e-05;
    
        relTol 0.1;
    }
    UFinal
    {
    
        solver smoothSolver;
    
        smoother symGaussSeidel;
    
        tolerance 1e-05;
    
        relTol 0.0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
}
